# ორივე პირობა უნდა იყოს ჭეშმარიტი იგივე დაგმაყოფილებელი  მინიმუმ ერთი პირობა უნდა იყოს ჭეშმარიტი ან დაგმაყოფილებული


# მაღაზია_ღიაა = True
# მაქვს_ფული = False
# მაღაზია_ღიაა and მაქვს_ფული
# print("ვყიდულობ ნაყინს")

# შაბათი = False
# კვირა = True
# შაბათი or კვირა
# print("არ მივდივარ სკოლაში")

# წვიმს = False
# ქარია = True
# წვიმს or ქარია
# print("წავალ ქოლგით")

# შაბათი = True
# კარგი_ამინდი = True
# შაბათი and კარგი_ამინდი:
# print("ვითამაშებ ფეხბურთს")

# დავალება_მოვრჩი = True
# მაქვს_დრო = True
# დავალება_მოვრჩი and მაქვს_დრო
# print("ვითამაშებ")

# მშია = True
# მოწყენილი_ვარ = False
# მშია or მოწყენილი_ვარ
# print("ვჭამ შოკოლადს")

# მაქვს_ტელეფონი = False
# მაქვს_ლეპტოპი = True
# მაქვს_ტელეფონი or მაქვს_ლეპტოპი
# print("შევდივარ ონლაინ გაკვეთილზე")

# ტელეფონი_შეერთებულია = True
# ინტერნეტი_მაქვს = True
# ტელეფონი_შეერთებულია and ინტერნეტი_მაქვს
# print("ტელეფონში ვითამაშებ")

# მაქვს_გასაღები = True
# ვიცი_კოდი = False
# მაქვს_გასაღები and ვიცი_კოდი
#print("შევდივარ სახლში")

# მეგობარი_მოვიდა = False
# დამირეკა = True
# მეგობარი_მოვიდა or დამირეკა
# print("გავალ გარეთ")


A = "გიორგი სპორტზეა"
B = "ანა მუსიკაზეა"

print(A and B)
print(A or B)

# AND-ში(&&) და OR-ში(||)