ცვლადი1 = 1
print(ცვლადი1)
ცვლადი2 = 2
print(ცვლადი2)
ცვლადი3 = 3
print(ცვლადი3)
ცვლადი4 = 4
print(ცვლადი4)
ცვლადი5 = 5
print(ცვლადი5)
ცვლადი6 = 6
print(ცვლადი6)
ცვლადი7 = 7
print(ცვლადი7)
ცვლადი8 = 8
print(ცვლადი8)
ცვლადი9 = 9
print(ცვლადი9)
ცვლადი10 = 10
print(ცვლადი10)




# snake_case-ი იწერება ქვედა ტირეთი მაგალითი = computer_keyboard_screen.
# camelcase-არის პირველი სიტყვა რომ იწერება პატარა ასოებით მეორე სიტყვა იწყება დიდი ასოთი და გრძელდება დიდი ასოთი.
# case sensitive language-არის მგრძნობიარე იმის მიმართ რომ დიდი მნიშვნელობა აქვს დიდი ასოთი დაწერ ცვლადის პირველ ასოს თუ პატარით.
# html-არის ვებგვერდების შექმნის ძირითად ენა მომხმარებელს გვერდი აჩვენებს ტექსტს სურათებს ლინკებს ფორმებს და კიდევ ბევრს.
# string-ით შეგვიძლია დავწეროთ სიტყვები და ასევე რიცხვებიც.
# integer-არის მთელი რიცხვი.
# float-არის არა მთელი რიცხვი.