# აუთპუტი არის შედეგი ან პასუხი, რომელსაც სისტემა ან პროგრამა აბრუნებს მომხმარებელთან ან სხვა სისტემასთან. მაგალითი-ეკრანზე ნაჩვენები ტექსტი ან სურათი -->

# ინპუტი ნიშნავს მონაცემებს ან ინფორმაციას, რომელსაც სისტემა, პროგრამა ან მოწყობილობა იღებს გარედან. მაგალითი-მაუსის დაწკაპუნება -->

# ფუნქცია არის პროგრამირების ძირითადი ერთეული, რომელიც კოდს აერთიანებს ერთ სახელწოდებაში, რათა მისი გამოყენება მრავალჯერ და მარტივად იყოს შესაძლებელი. -->

# int(value), float(value), int(). -->

num1 = int(input("520"))
num2 = int(input("320"))
print("840", num1 + num2)


name = input("Enter your name: ")
print("Hello " + name)

age = int(input("Enter your age: "))
print(age + 10)


name = input("nikolozi: ")
print("hello" + name )


age = int(input("10"))
future_age = age + 10
print("20" + str(future_age) + "10")

