#3)num = int(input("15"))
#if num < 18:
#    print("kid")
#elif num == 15:
#    print("15")
#else:
#    print("zangebi")




#4) if -> თუ -> იწერება მხოლოდ დასაწყისში და მარტო ერთხელ.      elif -> სხვა შემთხვევაში თუ -> იწერება if ის მერე და else ამდე, და შეგიძლია იმდენი დავწეროთ რამდენიც გაგვიხარდება.         else -> სხვა შემთხვევაში -> იწერება მხოლოდ ერთხელ სულ ბოლოში.




#5)int - მთელი რიცხვი.     float - ათწილადი.      str - ტექსტი.      bool - შედგება thru და folce-სგან.      list - ელემენტების დალაგებული კოლექცია.
